# 1
# front end არის ვებსაიტის ვისუალი რასაც ჩვენ გარედან ვხედავთ მაგალითად: ვებსაიტის დიზაინი განლაგება და ფუნქციონირება
# back end არის ვებსაიტის ის ნაწილი რომელსაც ჩვენ ვერ ვხედავთ მოიცავს სერვერებს,მონაცემთა ბაზებს და აპლიკაციის ლოგიკას რაც უზრუნველყოფს front end ის ფუნქციონირებას
# full stack არის ტექნოლოგიები და უნარები რომლებიც მოიცავს front end და back endის განვითარების ასპექტებს.full stack developer ი არის დეველოპერი რომელიც მუშაობს front end ზე და back end ზე
# HTML არის საიტის ჩონჩხი რაც ქმინის საიტის ძირითად ჩარჩოს გვეხმარება გვერდის განლაგებაში მულების დამატებაში და სხვა ელემენტებში
# css-ს დახმარებით შეგვიძლია შევცვალოთ ვებსაიტის დიძაინი რომელიც მომხმარებლისტვის ბევრად მიმზიდველია
# java script არის პროგრამირების ენა ვებსაიტის ინტერაქტიულობისათვის

# 2
# Tag ი არის html ელემენტის საფუძველი ანიჭებს კონტენტს შესაბამის სტრუქტურას და ფუნქციას.
# გამხსნელი tag ი არის tag რომელიც იწყებს ელემენტს.
# დამხურავი tag ი არის tag  რომელიც აკავშირებს და სრულყოფილს ხდის ელემენტს.
# კონტეინერ თეგი არის თეგი რომელიც შეიცავს გამხსნელ და დამხურავ თეგებს და მათშორის შინაარსს.
# empty tag არის ელემენტი რომელსაც არ აქვს შინაარსი და არ საჭიროებს დამხურავ tag-ს მაგალითად: <br> 

